<?php

function latin_to_ascii($string, $locale = FALSE, $force = TRUE) {

		$secondary = [];
		if(stripos($locale, 'de') !== FALSE) $secondary = ['Ä'=>'Ae', 'ä'=>'ae', 'Ö'=>'Oe', 'ö'=>'oe', 'Ü'=>'UE', 'ü'=>'ue', 'ß'=>'ss',]; /* https://core.trac.wordpress.org/browser/tags/4.3.1/src/wp-includes/formatting.php#L1250 */
		if(stripos($locale, 'da') !== FALSE) $secondary = ['Ø'=>'Oe', 'ø'=>'oe', 'Å'=>'Aa', 'å'=>'aa',]; /* https://core.trac.wordpress.org/browser/tags/4.3.1/src/wp-includes/formatting.php#L1258 */
		if(stripos($locale, 'vi') !== FALSE) $secondary = ['Đ'=>'D' , 'đ'=>'d' ,]; /* https://en.wikipedia.org/wiki/D_with_stroke#Vietnamese */

		$string = str_replace(
			['À','à','Á','á','Â','â','Ã','ã','Ä','ä','Å','å','Æ','æ','Ç','ç','È','è','É','é','Ê','ê','Ë','ë','Ì','ì','Í','í',
			 'Î','î','Ï','ï','Ð','ð','Ñ','ñ','Ò','ò','Ó','ó','Ô','ô','Õ','õ','Ö','ö','Ø','ø','Ù','ù','Ú','ú','Û','û','Ü','ü',
			 'Ý','ý','Þ','þ','ß','Ÿ','ÿ','Ā','ā','Ă','ă','Ą','ą','Ć','ć','Ĉ','ĉ','Ċ','ċ','Č','č','Ď','ď','Đ','đ','Ē','ē','Ĕ',
			 'ĕ','Ė','ė','Ę','ę','Ě','ě','Ĝ','ĝ','Ğ','ğ','Ġ','ġ','Ģ','ģ','Ĥ','ĥ','Ħ','ħ','Ĩ','ĩ','Ī','ī','Ĭ','ĭ','Į','į','İ',
			 'i','ı','Ĳ','ĳ','Ĵ','ĵ','Ķ','ķ','ĸ','Ĺ','ĺ','Ļ','ļ','Ľ','ľ','Ŀ','ŀ','Ł','ł','Ń','ń','Ņ','ņ','Ň','ň','ŉ','Ŋ','ŋ',
			 'Ō','ō','Ŏ','ŏ','Ő','ő','Œ','œ','Ŕ','ŕ','Ŗ','ŗ','Ř','ř','Ś','ś','Ŝ','ŝ','Ş','ş','Š','š','Ţ','ţ','Ť','ť','Ŧ','ŧ',
			 'Ũ','ũ','Ū','ū','Ŭ','ŭ','Ů','ů','Ű','ű','Ų','ų','Ŵ','ŵ','Ŷ','ŷ','Ź','ź','Ż','ż','Ž','ž','ſ','Ƕ','Ơ','ơ','Ư','ư',
			 'Ǆ','ǅ','ǆ','Ǉ','ǉ','ǈ','Ǌ','ǋ','ǌ','Ǎ','ǎ','Ǐ','ǐ','Ǒ','ǒ','Ǔ','ǔ','Ǖ','ǖ','Ǘ','ǘ','Ǚ','ǚ','Ǜ','ǜ','Ǟ','ǟ','Ǡ',
			 'ǡ','Ǣ','ǣ','Ǥ','ǥ','Ǧ','ǧ','Ǩ','ǩ','Ǫ','ǫ','Ǭ','ǭ','ǯ','Ǯ','ǰ','Ǳ','ǲ','ǳ','Ǵ','ǵ','Ǹ','ǹ','Ǻ','ǻ','Ǽ','ǽ','Ǿ',
			 'ǿ','Ȁ','ȁ','Ȃ','ȃ','Ȅ','ȅ','Ȇ','ȇ','Ȉ','ȉ','Ȋ','ȋ','Ȍ','ȍ','Ȏ','ȏ','Ȑ','ȑ','Ȓ','ȓ','Ȕ','ȕ','Ȗ','ȗ','Ș','ș','Ț',
			 'ț','Ȟ','ȟ','Ṯ','ṯ','Ḥ','ḥ','Ȥ','ȥ','Ȧ','ȧ','Ȩ','ȩ','Ȫ','ȫ','Ȭ','ȭ','Ȯ','ȯ','Ȱ','ȱ','Ȳ','ȳ','ɑ','Ə','ə','Ạ','ạ',
			 'Ả','ả','Ấ','ấ','Ầ','ầ','Ẩ','ẩ','Ẫ','ẫ','Ậ','ậ','Ắ','ắ','Ằ','ằ','Ẳ','ẳ','Ẵ','ẵ','Ặ','ặ','Ẹ','ẹ','Ẻ','ẻ','Ẽ','ẽ',
			 'Ế','ế','Ề','ề','Ể','ể','Ễ','ễ','Ệ','ệ','Ỉ','ỉ','Ị','ị','Ọ','ọ','Ỏ','ỏ','Ố','ố','Ồ','ồ','Ổ','ổ','Ỗ','ỗ','Ộ','ộ',
			 'Ớ','ớ','Ờ','ờ','Ở','ở','Ỡ','ỡ','Ợ','ợ','Ụ','ụ','Ủ','ủ','Ứ','ứ','Ừ','ừ','Ử','ử','Ữ','ữ','Ự','ự','Ỳ','ỳ','Ỵ','ỵ',
			 'Ỷ','ỷ','Ỹ','ỹ','J̌','ǰ','ƀ','Ƃ','ƃ','Ƅ','ƅ','Ƈ','ƈ','Ƌ','ƌ','ƍ','Ƒ','ƒ','Ƙ','ƙ','ƚ','ƞ','ƪ','ƫ','Ƭ','ƭ','ƴ','Ƶ',
			 'ƶ','Ƹ','ƹ','ƺ','Ƿ','Ǝ','ǝ','Ș','ș','Ț','ț','Ȝ','ȝ','ȡ','Ȣ','ȣ','Ɓ','Ɔ','Ɖ','Ɗ','Ɛ','Ɠ','Ɨ','Ɩ','Ɲ','Ɵ','Ʈ','Ʊ',
			 'Ʋ','Ʒ','Ḃ','ḃ','ḋ','Ḋ','Ḟ','ḟ','ṁ','Ṁ','ṗ','Ṗ','ṡ','Ṡ','Ṫ','ṫ','Ẁ','ẁ','Ẃ','ẃ','Ẅ','ẅ','ẛ',
			],
			['A','a','A','a','A','a','A','a','A','a','A','a','Ae','ae','C','c','E','e','E','e','E','e','E','e','I','i','I','i',
			 'I','i','I','i','D','d','N','n','O','o','O','o','O','o','O','o','O','o','O','o','U','u','U','u','U','u','U','u',
			 'Y','y','Th','th','s','Y','y','A','a','A','a','A','a','C','c','C','c','C','c','C','c','D','d','Dj','dj','E','e',
			 'E','e','E','e','E','e','E','e','G','g','G','g','G','g','G','g','H','h','H','h','I','i','I','i','I','i','I','i',
			 'I','i','i','Ij','ij','J','j','K','k','k','L','l','L','l','L','l','L','l','L','l','N','n','N','n','N','n','N','N',
			 'n','O','o','O','o','O','o','Oe','oe','R','r','R','r','R','r','S','s','S','s','S','s','S','s','T','t','T','t','T',
			 't','U','u','U','u','U','u','U','u','U','u','U','u','W','w','Y','y','Z','z','Z','z','Z','z','s','H','O','o','U',
			 'u','Dz','Dz','dz','Lj','lj','lj','Nj','Nj','nj','A','a','I','i','O','o','U','u','U','u','U','u','U','u','U','u',
			 'A','a','A','a','AE','ae','G','g','G','g','K','k','O','o','O','o','dz','dz','J','Dz','Dz','dz','G','g','N','n','A',
			 'a','ae','ae','O','o','A','a','A','a','E','e','E','e','I','i','I','i','O','o','O','o','R','r','R','r','U','u','U',
			 'u','S','s','T','t','H','h','T','t','H','h','Z','z','A','a','E','e','O','o','O','o','O','o','O','o','Y','y','a','a',
			 'a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','A','a','E','e','E','e',
			 'E','e','E','e','E','e','E','e','E','e','E','e','I','i','I','i','O','o','O','o','O','o','O','o','O','o','O','o','O',
			 'o','O','o','O','o','O','o','O','o','O','o','U','u','U','u','U','u','U','u','U','u','U','u','U','u','Y','y','Y','y',
			 'Y','y','Y','y','J','j','b','B','b','B','b','C','c','D','d','d','F','f','K','k','l','n','sh','t','T','t','y','Z','z',
			 'Zh','zh','zh','','E','e','S','s','T','t','J','j','d','Ou','ou','B','O','D','D','E','G','I','I','N','O','T','U','V',
			 'Zh','B','b','d','D','F','f','m','M','p','P','s','S','T','t','W','w','W','w','W','w','ss',
			 ],
			 strtr($string, $secondary)
		);
		// strip characters outside of Latin Basic if forced:
		return $force ? preg_replace('/[^\x20-\x7E]/u', '', $string) : $string;
	}